{
    "Symbol": "JPM",
    "AssetType": "Common Stock",
    "Name": "JPMorgan Chase & Co",
    "Description": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates in four segments: Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). The CCB segment offers deposit and investment products and services to consumers; lending, deposit, and cash management and payment solutions to small businesses; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit card, auto loan, and leasing services. The CIB segment provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt markets capital-raising services, as well as loan origination and syndication; wholesale payments and cross-border financing; and cash securities and derivative instruments, risk management solutions, prime brokerage, and research. This segment also offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. The CB segment provides financial solutions, including lending, investment banking, and asset management to small business, large and midsized corporations, local governments, and nonprofit clients; and commercial real estate banking services to investors, developers, and owners of multifamily, as well as to office, retail, industrial, and affordable housing properties. The AWM segment offers multi-asset investment management solutions across equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, trusts and estates, loans, mortgages, deposits, and investment management products. The company also provides ATM, online and mobile, and telephone banking services. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.",
    "Exchange": "NYSE",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Financial Services",
    "Industry": "Banks-Diversified",
    "Address": "383 Madison Avenue, New York, NY, United States, 10179",
    "FullTimeEmployees": "255351",
    "FiscalYearEnd": "December",
    "LatestQuarter": "2020-12-31",
    "MarketCapitalization": "460686458880",
    "EBITDA": "None",
    "PERatio": "17.0011",
    "PEGRatio": "3.0259",
    "BookValue": "81.75",
    "DividendPerShare": "3.6",
    "DividendYield": "0.0232",
    "EPS": "8.88",
    "RevenuePerShareTTM": "33.112",
    "ProfitMargin": "0.2854",
    "OperatingMarginTTM": "0.3578",
    "ReturnOnAssetsTTM": "0.0096",
    "ReturnOnEquityTTM": "0.1078",
    "RevenueTTM": "102062997504",
    "GrossProfitTTM": "102063000000",
    "DilutedEPSTTM": "8.88",
    "QuarterlyEarningsGrowthYOY": "0.478",
    "QuarterlyRevenueGrowthYOY": "0.158",
    "AnalystTargetPrice": "152.13",
    "TrailingPE": "17.0011",
    "ForwardPE": "14.8368",
    "PriceToSalesRatioTTM": "4.0055",
    "PriceToBookRatio": "1.8984",
    "EVToRevenue": "0",
    "EVToEBITDA": "0",
    "Beta": "1.2015",
    "52WeekHigh": "161.69",
    "52WeekLow": "79.9908",
    "50DayMovingAverage": "147.3965",
    "200DayMovingAverage": "122.009",
    "SharesOutstanding": "3051510016",
    "SharesFloat": "3025293996",
    "SharesShort": "23256676",
    "SharesShortPriorMonth": "20806258",
    "ShortRatio": "1.87",
    "ShortPercentOutstanding": "0.01",
    "ShortPercentFloat": "0.0077",
    "PercentInsiders": "0.854",
    "PercentInstitutions": "71.933",
    "ForwardAnnualDividendRate": "3.6",
    "ForwardAnnualDividendYield": "0.0238",
    "PayoutRatio": "0.3554",
    "DividendDate": "2021-04-30",
    "ExDividendDate": "2021-04-05",
    "LastSplitFactor": "3:2",
    "LastSplitDate": "2000-06-12"
}
